<template>
<h1>Информация про нас</h1>
<hr/>
<div class="d-flex flex-column mb-3">
    <div class="p-2">
        <div class="card" style="width: 18rem;">
            <img src="https://itproger.com/img/news/x1697989543.jpg.pagespeed.ic.1h32-SHmG2.webp" class="card-img-top" alt="...">
            <div class="card-body">
              <h5 class="card-title">Где уже есть роботакси и как они устроены?</h5>
              <p class="card-text">В некоторых городах мира такси без водителей уже стали реальностью. Но роботизированные технологии продолжают двигаться вперед. Это позволяет компаниям реализовывать все больше новых концептов.</p>
              <a href="#" class="btn btn-outline-primary" data-bs-toggle="modal" data-bs-target="#RoboTaxi">Далее</a>
            </div>
          </div>
    </div>
    <div class="p-2">
        <div class="card" style="width: 18rem;">
            <img src="https://itproger.com/img/news/x1697216729.jpg.pagespeed.ic.MlPDfp8hB3.webp" class="card-img-top" alt="...">
            <div class="card-body">
              <h5 class="card-title">Что такое DevOps на практике? Ключевые аспекты</h5>
              <p class="card-text">В мире быстро развивающихся технологий и цифровой трансформации, DevOps стал ключевым термином для организаций, стремящихся к улучшению производительности и скорости разработки программ.</p>
              <a href="#" class="btn btn-outline-primary" data-bs-toggle="modal" data-bs-target="#DevOps">Далее</a>
            </div>
          </div>
    </div>
  </div>
  <!--Модальные окна-->
  <div class="modal fade" id="RoboTaxi" tabindex="-1" aria-labelledby="exampleModalLabel" aria-hidden="true">
    <div class="modal-dialog">
      <div class="modal-content">
        <div class="modal-header">
          <h5 class="modal-title display-5 fw-bolder">Где уже есть роботакси и как они устроены?</h5>
          <button type="button" class="btn-close" data-bs-dismiss="modal" aria-label="Close"></button>
        </div>
        <div class="modal-body">
          <p class="display-5 fw-bolder">Где можно встретить роботакси?</p>
          <p>В 2021 году на Паралимпийских играх в Токио корпорация Toyota решила протестировать свое творение – робо-шаттл e-Palette. Но, к сожалению, испытания пришлось остановить, а авто отправить на доработку, т.к. произошло сразу несколько инцидентов. Несмотря на их неудачу, постепенное внедрение роботакси в разные страны мира стало реальностью. </p>
          <p>В 2022 году в Остине штат Техас, Сан-Франциско и Финиксе появилась целая служба беспилотных роботакси Chevy Bolt. Ее основателем стала компания Cruise. А поддержать проект решила компания General Motors. </p>
          <img src="https://itproger.com/img/news/x1697988957.webp.pagespeed.ic.QYlxiJOuTM.webp" class="img-thumbnail" alt="">
          <p>В Cruise решили не останавливаться на достигнутом, и уже к концу 2023 года планирует запустить роботакси нового поколения Origin. Он будет тестироваться в Сан-Франциско на дорогах общего пользования. Внешний вид беспилотного такси подобен шаттлу. А в салоне нет ни педалей, ни руля. </p>
          <p>Также в 2022 году появилась служба беспилотных такси в Лас-Вегасе. Ее основателями стала всемирно известная служба такси Uber и производитель технологий роботакси компания Motional. А уже в начале 2023 года вызывать роботакси можно круглосуточно. </p>
          <p>В Лас-Вегасе и Лос-Анджелесе появилась еще одна служба – Lyft. Ее сооснователем также стала компания Motional. Именно она занимается поставками электрокаров в это роботакси и Uber. Моделью выбора является Hyundai I ONIQ 5. </p>
          <p>Китай также не остался без своей службы роботизированного беспилотного такси. Уже в 10 городах страны можно встретить труды технологического гиганта Baidu. </p>
          <p>Роботакси стали также доступны в Дубай и Сеуле (Южная Корея), а в Японии, Австралии, Южной Корее и Сингапуре постепенно реализовываются пилотные проекты. </p>
          <p class="display-5 fw-bolder">Первое роботакси от Google</p>
          <p>Еще в 2009 году компания Google вместе с автомобилестроительной компанией Geely начала работу над разработкой роботакси. Проект имел название Google Self-Driving Car Project и являлся одним из первых проектов в области разработки автономных транспортных средств. </p>
          <p>Модель Firefly (Светлячок) была одной из ранних концепций, представленных в рамках этого проекта. Этот автомобиль был полностью автономным и не имел руля, педалей управления газом и тормозами, а также зеркал заднего вида. Вместо этого он оснащен сенсорами, камерами и лидарами для наблюдения за окружающей средой и принятия решений по управлению. В салоне два передних сидения, между которыми размещен экран со всем интерфейсом и функционалом для эффективного управления. Для пассажиров во втором ряду также предусмотрены экраны. </p>
          <iframe width="1280" height="720" src="https://www.youtube.com/embed/mKtatAxM48A" class="container container-sm container-md container-lg container-xl container-xxl" title="Waymo robotaxi" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share" allowfullscreen></iframe>
          <p>Компания предполагает, что уже в ближайшие пару лет сможет пополнить автопарк Waymo One новыми роботакси. </p>
          <p class="display-5 fw-bolder">Футуристический дизайн или робомобиль от Zoox</p>
          <p>Zoox, американский стартап, разработал уникальный концепт роботакси с футуристическим салоном. В июне 2020 года его приобрела Amazon, поэтому с вопросом об инвестировании все было просто.</p>
          <p>Основное отличие Zoox заключалось в том, что их робомашины  – это полностью автономные транспортные средства с нуля. Это означает, что у них нет сидений, которые обычно ориентированы вперед. Вместо этого салон представляет собой пространство, в котором пассажиры могут сидеть лицом друг к другу. Дизайн позволяет создать более эргономичную обстановку внутри автомобиля, что особенно актуально для роботакси, где место водителя не требуется.</p>
          <iframe width="1280" height="720" src="https://www.youtube.com/embed/3r7PEl0tMSk" class="container container-sm container-md container-lg container-xl container-xxl" title="Fully Autonomous, All-Electric and Built for Riders, Not Drivers—This is Zoox" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share" allowfullscreen></iframe>
          <p>Модель полностью симметрична, поэтому у нее нет выделенной передней и задней частей. Следовательно, робокар может ехать в любом направлении. Для этого также предусмотрены дублирование всех деталей конструкции, два лидара и пять радаров. Даже колеса приспособлены к движению в любом направлении. Максимальная скорость, которую может развить этот суперкар будущего – 120 км/ч.</p>
          <p>Кроме того, эти роботы оснащены четырьмя датчиками и камерами для обеспечения безопасности движения и наблюдения за окружающей средой. Они разрабатываются для полностью автономного движения и могут управляться исключительно программным обеспечением, без участия водителя.</p>
          <p>Такая концепция отражает будущее транспортной отрасли, где автомобили могут быть созданы с учетом новых возможностей, которые обеспечивают автономные технологии.</p>
        </div>
        <div class="modal-footer">
          <button type="button" class="btn btn-secondary" data-bs-dismiss="modal">Close</button>
          <button type="button" class="btn btn-primary">Save changes</button>
        </div>
      </div>
    </div>
  </div>

  <div class="modal fade" id="DevOps" tabindex="-1" aria-labelledby="exampleModalLabel" aria-hidden="true">
    <div class="modal-dialog">
      <div class="modal-content">
        <div class="modal-header">
          <h5 class="modal-title display-5 fw-bolder">Что такое DevOps на практике? Ключевые аспекты</h5>
          <button type="button" class="btn-close" data-bs-dismiss="modal" aria-label="Close"></button>
        </div>
        <div class="modal-body">
          <p>В мире быстро развивающихся технологий и цифровой трансформации, DevOps стал ключевым термином для организаций, стремящихся к улучшению производительности и скорости разработки программ.</p>
          <p>DevOps объединяет практики, инструменты и культурные изменения, чтобы сократить время между написанием кода и развертыванием программного обеспечения в боевых условиях. Давайте рассмотрим, что такое DevOps на практике и как его принципы применяются в современных организациях.</p>
          <p class="display-5 fw-bolder">Ключевые аспекты DevOps:</p>
          <ol>
            <li>Автоматизация процессов: Одним из основных принципов DevOps является автоматизация рутинных процессов, таких как сборка, тестирование и развертывание программного обеспечения. Инструменты для автоматизации позволяют ускорить процесс разработки и улучшить качество продукта.</li>
            <li>Культура сотрудничества: DevOps способствует созданию культуры сотрудничества между командами разработки и операций. Коммуникация, обмен знаниями и общие цели становятся ключевыми факторами для повышения эффективности и улучшения качества разработки.</li>
            <li>Использование облачных технологий: Облачные технологии стали неотъемлемой частью DevOps, обеспечивая масштабируемость, гибкость и ускоренное развертывание программного обеспечения. Использование облачных ресурсов позволяет командам быстро создавать, тестировать и развертывать новые функции.</li>
            <li>Непрерывная поставка и развертывание: DevOps акцентирует внимание на непрерывной поставке и развертывании, позволяя командам выпускать изменения в программном обеспечении быстро и безопасно. Непрерывное тестирование и автоматизированные процессы позволяют сократить время между внесением изменений и их выкаткой в продакшн.</li>
            <li>Мониторинг и обратная связь: Мониторинг производительности приложений и инфраструктуры является важной частью DevOps. Сбор и анализ данных об использовании и производительности помогают командам быстро реагировать на проблемы и недостатки.</li>
          </ol>
          <img src="https://itproger.com/img/news/1697216792.jpg" class="img-thumbnail" alt="">
          <p class="display-5 fw-bolder">Применение DevOps на практике:</p>
          <ol>
            <li>Интеграция инструментов непрерывной поставки: Команды DevOps интегрируют инструменты непрерывной поставки, такие как Jenkins, GitLab, или CircleCI, чтобы автоматизировать процессы сборки, тестирования и развертывания.</li>
            <li>Использование контейнеров и оркестрации: Использование технологий контейнеризации, таких как Docker, и оркестрации, например Kubernetes, позволяет эффективно управлять и масштабировать приложения в различных средах.</li>
            <li>Применение методологий Agile: Методологии Agile, такие как Scrum и Kanban, обеспечивают гибкую и итеративную модель разработки, что соответствует принципам DevOps.</li>
            <li>Развитие культуры DevOps: Организации активно развивают культуру DevOps, поощряя сотрудничество, обучение и участие в командных мероприятиях.</li>
            <li>Применение инструментов мониторинга и аналитики: Использование инструментов мониторинга, таких как Prometheus, Grafana, ELK stack, позволяет командам отслеживать производительность приложений и обеспечивать высокий уровень доступности и надежности.</li>
          </ol>
          <p>DevOps не только улучшает процессы разработки и операций, но и способствует более эффективному использованию ресурсов, снижению затрат и созданию более инновационных продуктов. Правильная реализация принципов DevOps в организации позволяет ускорить выход на рынок, повысить уровень удовлетворенности клиентов и достичь более высокой конкурентоспособности на фоне быстро меняющегося цифрового мира.</p>
        </div>
        <div class="modal-footer">
          <button type="button" class="btn btn-secondary" data-bs-dismiss="modal">Close</button>
          <button type="button" class="btn btn-primary">Save changes</button>
        </div>
      </div>
    </div>
  </div>
</template>
<script>
export default {
   data(){
    return({
        articles:[
            {
                photo: 'https://itproger.com/img/news/x1697989543.jpg.pagespeed.ic.1h32-SHmG2.webp',
                title: 'Где уже есть роботакси и как они устроены?',
                description: 'В некоторых городах мира такси без водителей уже стали реальностью. Но роботизированные технологии продолжают двигаться вперед. Это позволяет компаниям реализовывать все больше новых концептов.',
                next: 'Далее'
            },
            {
                photo: 'https://itproger.com/img/news/x1697216729.jpg.pagespeed.ic.MlPDfp8hB3.webp',
                title: 'Что такое DevOps на практике? Ключевые аспекты',
                description: 'В мире быстро развивающихся технологий и цифровой трансформации, DevOps стал ключевым термином для организаций, стремящихся к улучшению производительности и скорости разработки программ.',
                next: 'Далее'
            }
        ]
    })
   }
}
</script>
<style lang="scss" scoped>
hr{
width:25em;
font-weight:bolder;
background-color: #031cfc
}
.btn{
    text-transform: uppercase;
}
h1{
    font-weight: bolder;
}
</style>