<template>
    <img src="https://itproger.com/img/news/1547379865.jpg" class="img-thumbnail" alt="">
    <p class="fw-bolder display-5">Надо ли заклеивать камеру на ноутбуке?</p>
    <button v-on:click="showArticle()" v-on:mouseover="changeColor()" id="show" class="btn btn-outline-primary">{{ show }}</button>
    <button v-on:click="hideArticle()" v-on:mouseover="changeColor()" id="hide" class="btn btn-outline-primary">{{ hide }}</button>
    <article v-bind:style="display">
        <p>Заклеивать камеру ноутбука - паранойя или эффективное средство защититься от хакеров? Мы рассмотрим аспекты за и против и ответим на этот вездесущий вопрос.</p>
        <p>Часто думают так: кусок тёмного скотча должен спасти от слежки, тогда-то уж точно можно чувствовать себя защищённым. Вам не кажется это бредом? Сейчас мы разберёмся, почему пластырь не помощник в борьбе с хакерами.</p>
        <p class="display-5 fw-bolder">Имеет ли смысл заклеивать камеру?</p>
        <p>Может для многих и станет это удивлением, но для <b>99%</b> всех пользователей ноутбуков <b>нет</b> необходимости заклеивать камеру.</p>
        <p>Самая главная причина такого утверждения – хакерам абсолютно все равно, чем живёт человек, обстановка в квартире, с кем спит и прочее. Заниматься взломом компьютера и включением камеры будут только в случае наличия ценных данных. Что представляет интерес: похищение передовой технологии, логинов с паролями от аккаунтов в банках и т. п.</p>
        <img src="https://itproger.com/img/news/1547379643.jpg" class="img-thumbnail" alt="">
        <p>Даже в перечисленных случаях имеет смысл взламывать камеру только при возможности «поднять» хорошую сумму. Работа квалифицированного хакера стоит дорого. Чтобы в ней был смысл, должна быть многократная окупаемость процедуры.</p>
        <p>Для примера: Можно ли увидеть пароль от банка просто подключившись к камере?</p>
        <p>Открываем Skype, нажимаем на многоточие сверху окна, выбираем пункт «Настройки» и включаем «Проверить видео».</p>
        <p>В поле обзора не попадает клавиатура. Никто не будет сутками ждать хоть какой-то ценной информации на фоне. Кто из нас хранит на заднем фоне что-то важное? Если уж и нужно своровать пароли, скорее уж используют перехватчик клавиатуры.</p>
        <p class="display-5 fw-bolder">За вами подсматривают по вашей вине</p>
        <p>Самый распространённый способ подключиться к трансляции с камеры – добавить в систему цели вирус, троян типа Blackshades. Затем предстоит настроить отправку картинки на удалённый сервер с помощью TeamViewer, RemCam2 и т. п. Ещё может потребоваться код авторизации, его также нужно получить злоумышленнику для просмотра видео с камеры.</p>
        <p>Заражение произойдёт только в случае невнимательности: перехода по вредоносной ссылке, открытия файлов, отправленных по мессенджеру. Часто ещё приходится получать разрешение на использование камеры.</p>
        <p>Взлом камеры без ведома пользователя и подтверждения стоит от $300. Никто не станет платить такие деньги за вашу фотографию в трусах или без них.</p>
        <p class="display-5 fw-bolder">Кто из знаменитостей заклеивает камеру?</p>
        <p>Основатель Facebook - Марк Цукерберг. Это стало видно на одной из фотографий, где он рассказывал об успехах Instagram.</p>
        <img src="https://itproger.com/img/news/1547379099.png" class="img-thumbnail" alt="">
        <p>Сейчас внимание должно быть приковано к макбуку на заднем фоне. Здесь не только камера заклеена, но и на микрофоне изолента.</p>
        <img src="https://itproger.com/img/news/1547379101.png" class="img-thumbnail" alt="">
        <p class="display-5 fw-bolder">Что опаснее подглядывалок через веб-камеру?</p>
        <p>В списке снизу представлена пара насущных угроз, куда опаснее и серьёзнее подключения к камере:</p>
        <ul>
            <li>Фишинг. Фишинговые или поддельные веб-ресурсы имитируют дизайн известных сайтов с целью похищения ваших паролей с логинами. Таким образом они получают данные для входа в онлайн-банкинг, биржи, социальные сети и т. п.;</li>
            <li>Приложения, регулярно выполняющие скриншоты экрана. Затем они отправляют данные злоумышленнику. Поэтому хранить пароли в блокноте – не лучшая идея;</li>
            <li>Программы для вычисления GPS-координат. У хакеров появляется доступ к точному местоположению. Таким образом они всегда знают время, когда никого нет дома;</li>
            <li>Захват звука с микрофона. Способ намного эффективнее, так как распознание речи происходит быстрее и аудио можно хорошо отфильтровать. Этим методом нередко похищают идеи у конкурентов и другие озвученные секреты компании.</li>
        </ul>
        <p class="display-5 fw-bolder">Как не стать интернет-звездой из-за подглядывания с камеры?</p>
        <p>Предположим, что всё ещё остался страх перед взломом камеры на смартфоне или ноутбуке. Благоразумие и осторожность помогут избежать заражения телефона и компьютера:</p>
        <ol>
            <li>Не устанавливайте посторонние программы с неизвестных источников, всегда изучайте URL-адрес сайта, на который переходите, игнорируйте все левые ссылки.</li>
            <li>Сто раз подумайте – один раз откройте файл, присланный на почту, в чате и т. п. Только имея <mark>100%-ную</mark> уверенность можно открывать файлы.</li>
            <li>Просто так не добавляйте в систему утилиты удалённого управления. Это нужно делать только по просьбе сисадмина или для предоставления доступа к компьютеру профессионалу. Как только специалист устранит проблему, программу можно удалять с системы. Очевидно, что пароль из приложения нужно передавать только админу и никому больше.</li>
            <li>Хорошая антивирусная программа с обновлёнными базами данных может и не предотвращает заражение на <mark>100%</mark>, но сильно увеличивает стоимость работ по взлому.</li>
            <li>Отдайте предпочтение мессенджерам, использующим оконечное шифрование. Ещё стоит перейти с бесплатных VPN-сервисов на платные, где должное внимание уделяется конфиденциальности.</li>
            <li>Установите двухфакторный доступ на всех сервисах, которые это поддерживают.</li>
        </ol>
        <p>Больше интересных новостей</p>
    </article>
    
    <form method="post" class="row g-3" autocomplete="off">
        <div class="col-md-4">
          <label for="validationDefault01" class="form-label">Имя:</label>
          <input v-model="name"  type="text"  class="form-control" id="validationDefault01"  required>
          <p v-show="name.length < 4" class='text-info bg-dark'>Длинна имени должна быть не менее 4 символов</p>
          <label  for="alidationDefault02" class="form-label">Комментарий:</label>
          <textarea v-model="comment" class="form-control" id="validationTextarea" placeholder="Required example textarea" required></textarea>
          <p v-show="comment.length == 0" class='text-info bg-dark'>Комментарий не может быть пустым</p>
          <button type="button" v-on:click="AddComment()" class="btn btn-primary">Добавить комментарий</button>
        </div>
    </form>
    <div v-for="(el,key) in NewComment" v-bind:key="key">
        <p>{{ el.Authors }}</p>
        <p>{{ el.comments }}</p>
        <p id="error"></p>
    </div>
</template>
<script>
export default {
    data(){
        return{
            show: 'Показать',
            hide: 'Скрыть',
            display: '',
            name: '',
            comment: '',
            NewComment:[
                {
                    Authors:'',
                    comments: ''
                }
            ]
        }
    },
    methods:{
        showArticle(){
            this.display = 'display:block'
        },
        hideArticle(){
            this.display = 'display:none'
        },
        changeColor(){
            let show = document.getElementById('show')
            let hide = document.getElementById('hide')
            show.addEventListener('mouseover',function(){
                show.style.backgroundColor = '#dd00ff'
                show.style.color = '#00ff5e'
            })
            hide.addEventListener('mouseover',function(){
                hide.style.backgroundColor = '#dd00ff'
                hide.style.color = '#00ff5e'
            })
        },
        AddComment(){
            let error = document.getElementById("error")
            if(this.name && this.comment !== ""){
                    error.innerHTML = ""
                    this.NewComment.push({
                    Authors: this.name,
                    comments: this.comment
                })
             }
             else if(this.name.length < 4){
                error.innerHTML = "<p class='text-danger bg-dark'>Ошибка! Длинна имени должна быть минимум 4 символа</p>"
             }
             else{
                error.innerHTML = "<p class='text-danger bg-dark'>Ошибка! Имя и комментарий не могут быть пустыми</p>"
             }
        }
    }
}
</script>
<style scoped>
article{
    display: none;
}
</style>