<template>
    <img src="https://itproger.com/img/news/x1545494897.jpg.pagespeed.ic.JJL7KYg34M.webp" class="img-thumbnail" alt="">
    <p class="fw-bolder fs-1">5 будущих профессий для IT специалистов</p>
    <button v-on:click="showArticle()" v-on:mouseover="changeColor()" id="show" class="btn btn-outline-primary">{{ show }}</button>
    <button v-on:click="hideArticle()" v-on:mouseover="changeColor()" id="hide" class="btn btn-outline-primary">{{ hide }}</button>
    <article v-bind:style="display">
       <p>5 будущих профессий для IT специалистов</p>
       <p>Профессии постоянно пополняются и IT сфера вовсе не исключение. Мы подготовили список из 5 возможных будущих профессий, к которым можно подготовиться уже сейчас.</p>
       <p>В последние 10 лет постоянно ведутся диалоги о скором вытеснении человека с производственных предприятий. Футурологи утверждают, что скоро человеку практически не останется места, технологии просто возьмут на себя основную часть работы. Несмотря на потенциальное отмирание многих профессий, появляются и новые, которые очень хорошо оплачиваются. Ожидается, что востребованными станут специалисты, работающие с техникой и роботами. </p>
       <p>Чтобы получить перспективную профессию, уже сейчас стоит начинать менять работу. Для читателя мы подготовили 5 самых перспективных профессий, за которыми будущее.</p>
       <p class="display-5 fw-bolder">1. Дизайнер виртуальных миров</p>
       <p>Виртуальная реальность только начала разрабатываться и ещё явно не дошла до пика функциональности. Ей есть куда развиваться и скорее всего это и будет происходить ближайшие 10 лет. В будущем виртуальная реальность полностью поглотит социальные сети, игры и многие сферы физической жизни. Очки виртуальной реальности станут таким же необходимым гаджетом, как и смартфон. </p>
       <p>Только кажется, что технология ещё не скоро получит такое распространение, но ведь современный мир делает огромные шаги вперёд каждый год. Уже многие дальновидные компании начинают создавать собственные виртуальные миры, для которых и понадобятся дизайнеры. В них очень много работы, нужно: привязать законы физики, разработать ландшафт, создать социальную составляющую, максимально передать физические ощущения (звуки, запахи). Полное погружение в уже совсем скоро перестанет быть фантастикой.</p>
       <img src="https://itproger.com/img/news/x1545494174.jpg.pagespeed.ic.ukEMmkm69W.webp" class="img-thumbnail" alt="">
       <p>Сегодня уже стоит начинать изучать данную отрасль. Специалисты по созданию миров начинают пользоваться спросом, и данная тенденция будет только набирать обороты. До тех пор можно заниматься подобной сферой на позиции игровой дизайнер. Это поможет получать неплохой доход до наступления «будущего». </p>
       <p class="display-5 fw-bolder">2. Сетевой юрист</p>
       <p>Разработка виртуальной реальности неизбежно приведёт к необходимости сетевого юриста. Суть работы заключается в создании законодательных актов прямо в «альтернативном» мире. Правоохранительная система придёт к тому, чтобы защищать людей в виртуальной реальности. Придётся как-то обозначать собственность и права человека, юрист будет очень кстати.</p>
       <img src="https://itproger.com/img/news/x1545494304.jpg.pagespeed.ic._gz94dCDhb.webp" class="img-thumbnail" alt="">
       <p>На данный момент самой приближённой профессией можно считать сетевой юрист, занимающийся оформлением авторского права. В данной отрасли специалисту придётся всё время взаимодействовать с IT, что поможет её лучше понять. Чтобы сохранить востребованность, уже сейчас стоит переквалифицироваться в сетевого юриста.</p>
       <p class="display-5 fw-bolder">3. Программист эскизов одежды в электронном виде</p>
       <p>Никому не станет удивлением, что одежду скоро начнут распечатывать прямо на принтере. Где же брать эскиз для неё? Правильно, заказывать у дизайнера. 3D принтеры уже показывают невероятные результаты, но им ещё есть куда развиваться. Как только они станут доступны всем и получат возможность создавать эластичные вещи, разработка одежды в электронном формате получит новое дыхание.
        Для реализации технологии создания напечатанной одежды потребуются программисты. Основная суть работы заключается в переводе уже существующих моделей одежды в цифровой вид. Можно также заняться собственноручной разработкой эскизов с нуля. В продвинутых странах уже во всю идёт производство вещей с помощью 3D-технологий, правда пока что это не одежда.</p>
        <img src="https://itproger.com/img/news/x1545494640.jpg.pagespeed.ic.pccn7ze3Kx.webp" class="img-thumbnail" alt="">
       <p>Чем зарабатывать сегодня? Вначале своего пути лучше приобрести специальность программиста, инженера или робототехника. В каждом случае удастся развить очень полезные навыки программирования и взаимодействия с роботами.</p>
       <p class="display-5 fw-bolder">4. Настройщик ИИ-переводов</p>
       <p>Переводчики уже сегодня вынуждены использовать IT, но совсем скоро ИТ-сфера станет неотъемлемой частью. Даже сейчас многие пользуются онлайн-переводчиками, которые работают за счёт искусственного интеллекта (ИИ). Конечно, ещё у машин не хватает ума выдавать связный и качественный текст, но ведь именно настройщики и будут заниматься обучением ИИ. Их роль заключается в обучении искусственного интеллекта лучше понимать смысл и контекст. Проще говоря, специалисты повысят качество переводов.</p>
       <img src="https://itproger.com/img/news/x1545494736.png.pagespeed.ic.7u5f2Xac3T.webp" class="img-thumbnail" alt="">
       <p>Себе на жизнь сейчас можно зарабатывать программированием. У вас есть время хорошо и углублённо изучить несколько языков программирования, которые позволят неплохо зарабатывать. Переводчикам сейчас стоит задумываться об интеграции своей работы с IT.</p>
       <p class="display-5 fw-bolder">5. ИТ-агитатор</p>
       <p>Современные технологии очень хорошо воспринимаются молодым поколением. Люди добровольно гоняются за новинками в IT-сфере. Что касается среднего и старшего поколения, то ещё многие относятся к этой сфере с осторожностью, сохраняя консервативный подход. Агитаторы как раз и будут знакомить людей с технологиями и продвигать их в массах. Специалисты помогут получить грамотность в цифровой сфере и будут отвечать за осведомление населения.</p>
       <img src="https://itproger.com/img/news/x1545494812.jpg.pagespeed.ic.2aQ2VlrlAb.webp" class="img-thumbnail" alt="">
       <p>Сегодня получить доход поможет приближённая по смыслу работу – маркетолог или специалист по работе с людьми. Главная задача заключается в обучении продвижения товара. Конечно, не стоит отставать от IT-трендов, иначе вас самих придётся обучать. Немаловажным является знание программирования и ИИ.</p>
       <hr/>
       <p>Нельзя воспринимать всё описанное буквально, мышление человека всегда находит всё новые сферы работы. Невозможно точно предсказать будущее, но скорее всего специальности действительно появятся и станут востребованными. Есть вероятность, что все перечисленные профессии придётся совмещать одному человеку или напротив, функции каждой профессии распадутся на несколько частей. </p>
       <p>Будущее наступит быстро, к нему нужно быть готовыми, иначе можно потерять источник доходов.</p>
       <p>Больше интересных новостей</p>
    </article>

    <form method="post" class="row g-3" autocomplete="off">
        <div class="col-md-4">
          <label for="validationDefault01" class="form-label">Имя:</label>
          <input v-model="name"  type="text"  class="form-control" id="validationDefault01"  required>
          <p v-show="name.length < 4" class='text-info bg-dark'>Длинна имени должна быть не менее 4 символов</p>
          <label  for="alidationDefault02" class="form-label">Комментарий:</label>
          <textarea v-model="comment" class="form-control" id="validationTextarea" placeholder="Required example textarea" required></textarea>
          <p v-show="comment.length == 0" class='text-info bg-dark'>Комментарий не может быть пустым</p>
          <button type="button" v-on:click="AddComment()" class="btn btn-primary">Добавить комментарий</button>
        </div>
    </form>
    <div v-for="(el,key) in NewComment" v-bind:key="key">
        <p>{{ el.Authors }}</p>
        <p>{{ el.comments }}</p>
        <p id="error"></p>
    </div>
</template>
<script>
export default {
    data(){
        return{
            show: 'Показать',
            hide: 'Скрыть',
            display: '',
            name: '',
            comment: '',
            NewComment:[
                {
                    Authors:'',
                    comments: ''
                }
            ]
        }
    },
    methods:{
        showArticle(){
            this.display = 'display:block'
        },
        hideArticle(){
            this.display = 'display:none'
        },
        changeColor(){
            let show = document.getElementById('show')
            let hide = document.getElementById('hide')
            show.addEventListener('mouseover',function(){
                show.style.backgroundColor = '#dd00ff'
                show.style.color = '#00ff5e'
            })
            hide.addEventListener('mouseover',function(){
                hide.style.backgroundColor = '#dd00ff'
                hide.style.color = '#00ff5e'
            })
        },
        AddComment(){
            let error = document.getElementById("error")
            if(this.name && this.comment !== ""){
                    error.innerHTML = ""
                    this.NewComment.push({
                    Authors: this.name,
                    comments: this.comment
                })
             }
             else if(this.name.length < 4){
                error.innerHTML = "<p class='text-danger bg-dark'>Ошибка! Длинна имени должна быть минимум 4 символа</p>"
             }
             else{
                error.innerHTML = "<p class='text-danger bg-dark'>Ошибка! Имя и комментарий не могут быть пустыми</p>"
             }
        }
    }
}
</script>
<style scoped>
article{
    display: none;
}
</style>