<template>
    <p class="fw-bolder fs-1">Какие языки программирования ненавидят больше и почему?</p>
    <button v-on:click="showArticle()" v-on:mouseover="changeColor()" id="show" class="btn btn-outline-primary">{{ show }}</button>
    <button v-on:click="hideArticle()" v-on:mouseover="changeColor()" id="hide" class="btn btn-outline-primary">{{ hide }}</button>
    <article v-bind:style="display">
        <img src="https://itproger.com/img/news/1547377263.jpg" class="img-thumbnail" alt="">
        <p class="display-6 fw-bolder">Какие языки программирования ненавидят больше и почему?</p>
        <p>Авторитетный веб-ресурс Stack Overflow решил заняться опросом в отношении языков программирования. В этот раз в центре внимания нелюбимые языки.</p>
        <img src="https://itproger.com/img/news/1547377405.png" class="img-thumbnail" alt="">
        <p class="display-6 fw-bolder">Вне конкуренции: MATLAB, CoffeeScript</p>
        <p>Сразу в голову и не приходят причины, почему данные языки попали в антирейтинг. Тот же <b>CoffeeScript</b> – удачно дополняет JavaScript и делает его проще в использовании. В интернете нет статей, где автор рекомендовал бы возвратиться к чистому JS или перейти на <b>TypeScript</b>. Все негативные отзывы о CoffeeScript основаны лишь на недостатках в его поддержке, что нередко приводило к трудностям в отладке и компиляции. Однако с выходом 2 версии языка, многие проблемы остались в прошлом. Что ж, посмотрим на позиции CoffeeScript к концу 2019 года.</p>
        <img src="https://itproger.com/img/news/1547377623.png" class="img-thumbnail" alt="">
        <p><b>MATLAB</b> – узкоспециализированный язык, который не используется повсеместно. Большинство разработчиков, работающих на MATLAB – не являются программистами. Нелюбовь к данному языку заключается в том, что разработчики сравнивают тот же Python с MATLAB. </p>
        <p>Конечно же, в последнем будет: </p>
        <ul>
            <li>малоэффективный синтаксис;</li>
            <li>недостаток свободы в ООП;</li>
            <li>вынужденная разработка в пределах одной системы. </li>
        </ul>
        <p>Несправедливо данные претензии адресовать к языку, разработанному <b>33 года назад</b> с целью решения задач в отдельных отраслях.</p>
        <p class="display-6 fw-bolder">Бронза: Visual Basic</p>
        <p>Не секрет, что Visual Basic состоит из трёх ответвлений: VB6, VBA и VB.NET. Вызывает удивление, что все три ветки попали в антирейтинг. Что же стало причиной общей ненависти к языкам?
            Первая причина – прекращена поддержка Visual Basic на протяжении последних лет. Главная же причина заключается в слабом развитии языка и небольшом наборе возможностей. О чем ещё можно говорить, если в Visual Basic отсутствует полноценное наследование и полиморфизм. Правда, несколько странно нелестно отзываться в отношении похороненного языка.
            Совсем иначе дело обстоит с VB.NET. Он обладает всеми достоинствами платформы .NET и является достойным языком для разработки. Вполне соответствует современным требованиям программирования. Среди существенных минусов: наследование реализовано за счёт механизма имитации, язык работает исключительно на Windows. Также слабая сторона VB.NET - синтаксис. Если учесть, что этот синтаксис языка сильно напоминает C#, которого нет в топе, скорее всего он не является основной причиной ненависти.</p>
            <img src="https://itproger.com/img/news/1547377782.jpg" class="img-thumbnail" alt="">
        <p>
            Visual Basic for Applications обладает всеми недостатками из перечисленных ранее ветвей. Для меня этот язык годен только для написания макросов под Excel и не более того. При каждом открытии среды разработки кажется, что внешний вид и количество инструментов явно застряли в <b>2001-2004 годах.</b>
            Вот VBA уже является довольно полезным языком при создании приложений под Windows. Конечно, здесь не хватает продвинутого синтаксиса, наподобие Python, многообразия инструментов, вроде JS и Java, обширной документации и сообщества. Даже с перечисленными недостатками, язык неплохо справляется с настройкой взаимодействия нескольких программ. Также на нём удобно разрабатывать скрипты для работы по локальной сети.
        </p>
        <p class="display-6 fw-bolder">Серебро: Java</p>
        <p>
            Лично моё впечатление – попадание Java в список является результатом невероятной популярности языка. Если выбрать 100 или 1000 разработчиков на том же <mark>Stack Overflow</mark>, больше половины окажется специалистами по Java или хотя бы знакомы с его особенностями. Пусть у Java и есть недостатки, но их явно не больше, чем у JS, C#, Cobol и подобных.
            Самая распространённая претензия к языку – устаревший синтаксис, разработанный 25 лет назад. При этом нет ни одной важной причины сохранения этого синтаксиса, напротив, есть недостатки в: быстродействии, эффективности задействования системных ресурсов и надёжности работы.
            Многочисленные направления использования языка точно не пошли Java в прок. К примеру, сравнив мобильное приложение на Swift с Java, последнее покажется сильно ограниченным и неудобным. Правда, для разработки компьютерных приложений Java остаётся одной из наиболее комфортных сред для решения комплексных задач.
        </p>
        <p class="display-6 fw-bolder">Золото: Perl</p>
        <p>Первое место за Perl, что не столько говорит о качестве языка, сколько об его пользователях. Всё сообщество разделилось на <b>3 фронта.</b> </p>
        <ol>
            <li>Одни разработчики уже смирились с недостатками <b>Perl</b> и с лёгкостью компенсируют их. </li>
            <li>Представители второго фронта – это перебежчики с других языком или начинающие программисты. </li>
            <li>Всё остальное пространство между обеими группами – это люди, которые повсюду заявляют, что у <b>Perl:</b> неудачный синтаксис, кривой ООП, неправильная реализация многопоточности.</li>
        </ol>
        <p>Так и появляется миф, что у языка нет полноценного сообщества.</p>
        <img src="https://itproger.com/img/news/1547378182.png" class="img-thumbnail" alt="">
        <p>Perl исполнилось 30 лет, а на время его создания синтаксис казался очень простым и предельно понятным. При этом если присмотреться к другим языкам из девяностых, кое-что можно было бы и улучшить. 
            Явный недостаток – слаборазвитая экосистема, пустота на поле специализированных IDE и скудность инструментария разработчика. С нашей стороны неразумно сравнивать Perl с JS или Python, перед ним нет настолько сложных задач. Для достижения своих целей вполне достаточно экосистемы и текущих возможностей.
        </p>
        <hr/>
        <p>Результаты опроса на <b>Stack Overflow</b> отражают лишь то, что разработчики стремятся получать: простой синтаксис, множество инструментов и быструю скорость работы. Насколько правильного курса придерживается сообщество покажет время.</p>
    </article>
    <form method="post" class="row g-3" autocomplete="off">
        <div class="col-md-4">
          <label for="validationDefault01" class="form-label">Имя:</label>
          <input v-model="name"  type="text"  class="form-control" id="validationDefault01"  required>
          <p v-show="name.length < 4" class='text-info bg-dark'>Длинна имени должна быть не менее 4 символов</p>
          <label  for="alidationDefault02" class="form-label">Комментарий:</label>
          <textarea v-model="comment" class="form-control" id="validationTextarea" placeholder="Required example textarea" required></textarea>
          <p v-show="comment.length == 0" class='text-info bg-dark'>Комментарий не может быть пустым</p>
          <button type="button" v-on:click="AddComment()" class="btn btn-primary">Добавить комментарий</button>
        </div>
    </form>
    <div v-for="(el,key) in NewComment" v-bind:key="key">
        <p>{{ el.Authors }}</p>
        <p>{{ el.comments }}</p>
    </div>
</template>
<script>
export default {
    data(){
        return{
            show: 'Показать',
            hide: 'Скрыть',
            display: '',
            name: '',
            comment: '',
            NewComment:[
                {
                    Authors:'',
                    comments: ''
                }
            ]
        }
    },
    methods:{
        showArticle(){
            this.display = 'display:block'
        },
        hideArticle(){
            this.display = 'display:none'
        },
        changeColor(){
            let show = document.getElementById('show')
            let hide = document.getElementById('hide')
            show.addEventListener('mouseover',function(){
                show.style.backgroundColor = '#dd00ff'
                show.style.color = '#00ff5e'
            })
            hide.addEventListener('mouseover',function(){
                hide.style.backgroundColor = '#dd00ff'
                hide.style.color = '#00ff5e'
            })
        },
        AddComment(){
            this.NewComment.push({
               Authors: this.name,
               comments: this.comment
            })
        }
    }
}
</script>
<style scoped>
article{
    display: none;
}
img:hover{
    cursor: pointer;
}
</style>